## Staging: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                 NAME                                  |
|----------|-----------------------------------------------------------------------|
| update   | `module.cra_upd_documentdb.aws_docdb_cluster.this[0]`                 |
| recreate | `module.cra_upd_documentdb.aws_docdb_cluster_parameter_group.this[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cra_upd_documentdb.aws_docdb_cluster.this[0] will be updated in-place
  ~ resource "aws_docdb_cluster" "this" {
      ~ deletion_protection             = false -> true
        id                              = "upd"
        tags                            = {
            "CostCentre" = "cra-upd-dashboard"
            "Terraform"  = "true"
        }
        # (32 unchanged attributes hidden)
    }

  # module.cra_upd_documentdb.aws_docdb_cluster_parameter_group.this[0] must be replaced
-/+ resource "aws_docdb_cluster_parameter_group" "this" {
      ~ arn         = "arn:aws:rds:ca-central-1:211125499457:cluster-pg:parameter-group-upd" -> (known after apply)
      ~ family      = "docdb5.0" -> "docdb8.0" # forces replacement
      ~ id          = "parameter-group-upd" -> (known after apply)
        name        = "parameter-group-upd"
      + name_prefix = (known after apply)
        tags        = {
            "CostCentre" = "cra-upd-dashboard"
            "Terraform"  = "true"
        }
        # (2 unchanged attributes hidden)

      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "default_collection_compression" -> null
          - value        = "enabled" -> null
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "default_collection_compression"
          + value        = "zstd"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.cra_upd_docdb_egress_sg"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.cra_upd_docdb_sg"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
